conf1/src/Documents/УслугаСортировки/УслугаСортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УслугаСортировки</name>
  <posting>Deny</posting>
  <attributes>
    <name>НомерГрузовогоМеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУбытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТипаОбработки</name>
    <type>
      <types>EnumRef.КодыТиповОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

conf1/src/Enums/КодыТиповОбработки/КодыТиповОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыТиповОбработки</name>
  <enumValues>
    <name>Хаб</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>КГТ</name>
  </enumValues>
  <enumValues>
    <name>МГТ</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
</mdclass:Enum>

conf1/src/Documents/УслугаСортировки/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает выборку документов за месяц указанной даты
//
// Параметры:
// ДатаМесяца  - Дата - Дата за месяк которой нужно получить выборку долкументов
//
// Возвращаемое значение:
//   	ВыборкаИзРезультатаЗапроса.   - <описание возвращаемого значения>
//
Функция ПолучитьВыборкуДокументовЗаМесяц(ДатаМесяца)Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокУслугаСортировки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УслугаСортировки КАК СписокУслугаСортировки
	|ГДЕ
	|	СписокУслугаСортировки.ДатаУбытия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ СписокУслугаСортировки.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписокУслугаСортировки.ДатаУбытия
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаМесяца));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ДатаМесяца));
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выбрать();
КонецФункции // ПолучитьВыборкуДокументовЗамесяц()

// Возвращает среднее количество единиц проходящих через Хаб за месяц
//
// Параметры:
// ДатаМесяца  - Дата - Дата за месяк которой нужно получить выборку долкументов
//
// Возвращаемое значение: 
// 		Число   - среднее количество единиц проходящих через Хаб за месяц
//
Функция ПолучитьСреднееКоличествоЕдиницПроходящихЧерезХабЗаМесяц(ДатаМесяца)Экспорт 
	
	ОдинДень = 86400;
	КоличествоКалендарныхДней = (НачалоДня(КонецМесяца(ДатаМесяца)) - НачалоМесяца(ДатаМесяца)) / ОдинДень;
	КоличетсвоНаХабеЗаМесяц = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СписокУслугаСортировки.Ссылка) КАК КоличетсвоНаХабеЗаМесяц
	|ИЗ
	|	Документ.УслугаСортировки КАК СписокУслугаСортировки
	|ГДЕ
	|	СписокУслугаСортировки.ДатаУбытия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ СписокУслугаСортировки.ПометкаУдаления
	|	И СписокУслугаСортировки.КодТипаОбработки = ЗНАЧЕНИЕ(Перечисление.КодыТиповОбработки.Хаб)";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаМесяца));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ДатаМесяца));
	
	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда 
		
		КоличетсвоНаХабеЗаМесяц = Выборка.КоличетсвоНаХабеЗаМесяц;
	КонецЕсли;                                                    
	
	Возврат Цел(КоличетсвоНаХабеЗаМесяц / КоличествоКалендарныхДней);
КонецФункции // ПолучитьСреднееКоличествоЕдиницПроходящихЧерезХаб()

// Возвращает количество дней хранения груза
//
// Параметры:
//  УслугаСортировки  - ДокументСсылка.УслугаСортировки - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение: 
// 		Число   - Количество дней хранения груза
//
Функция ПолучитьОбщееКоличествоДнейХраненияГруза(УслугаСортировки)Экспорт 
	
	ОдинДень = 86400;
	КоличествоДнейХраненияГруза = (НачалоДня(УслугаСортировки.ДатаУбытия) - НачалоДня(УслугаСортировки.ДатаПрибытия)) / ОдинДень; 
	Возврат Цел(КоличествоДнейХраненияГруза);
КонецФункции // ПолучитьОбщееКоличествоДнейХраненияГруза(УслугаСортировки)

// Возвращает количество дней хранения груза (отдельно рабочие дни и выходные)
//
// Параметры:
//  УслугаСортировки  - ДокументСсылка.УслугаСортировки - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение: 
// 		Структура   - Количество дней хранения груза
//
Функция ПолучитьСведенияПоДнямХраненияГруза(УслугаСортировки)Экспорт 
		
	СведенияПоДнямХраненияГруза = Новый Структура("КоличествоРабочихДней, КоличествоВыходныхДней", 0, 0);	
	
	ОдинДень = 86400;
	ВременнаяДата = УслугаСортировки.ДатаПрибытия;
	Пока ВременнаяДата < УслугаСортировки.ДатаУбытия Цикл 
				
		Если МетодыОбщегоНазначения.ЭтоВыходной(ВременнаяДата) Тогда 
			
			СведенияПоДнямХраненияГруза.КоличествоВыходныхДней = СведенияПоДнямХраненияГруза.КоличествоВыходныхДней + 1;
		Иначе                                             
			
			СведенияПоДнямХраненияГруза.КоличествоРабочихДней = СведенияПоДнямХраненияГруза.КоличествоРабочихДней + 1;
		КонецЕсли;
		
		ВременнаяДата = ВременнаяДата + ОдинДень;
	КонецЦикла;
	
	Возврат СведенияПоДнямХраненияГруза;
КонецФункции // ПолучитьСведенияПоДнямХраненияГруза(УслугаСортировки)

#КонецОбласти
